app/views/shared/_navbar.html.erb

    .main_menu .cart i:after{
      content: "<%= current_user.user_carts.where(status: 0).present? ? current_user.user_carts.where(status: 0).last.user_cart_products.count : 0; %>";
---
SELECT "user_carts".* FROM "user_carts" WHERE "user_carts"."user_id" = $1 AND "user_carts"."status" = $2  [["user_id", 7], ["status", 0]]