app/models/user.rb

  def create_profile
    if self.is_vendor?
      self.create_profile!
---
INSERT INTO "profiles" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-10-18 23:28:39.979770"], ["updated_at", "2021-10-18 23:28:39.979770"], ["user_id", 7]]

  def create_company
    if self.is_vendor?
      self.companies.create(title: self.full_name)
---
INSERT INTO "companies" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Dorothy Stephens"], ["created_at", "2021-10-18 23:28:40.067974"], ["updated_at", "2021-10-18 23:28:40.067974"], ["user_id", 7]]